using UnityEngine;

namespace Study.MiniFarm._03._Farming
{
    /*
    Crop과 Crop 성장 기능 제작 실습
    
    # 주어진 리소스를 활용해서(FarmRPG/Crop) 작물의 각 성장단계를 표현할 수 있는 컴포넌트를 작성하세요
    - WorldClock의 시간 진행에 따라 작물이 성장해야합니다.
    - 현재 Day가 120초로 되어있지만 테스트를 위해 수정하셔도 무방
D
    # 작물은 스프라이트 이미지 갯수에 따라 성장일이 조정됩니다.
    - EX) 5개면 4일 (씨앗 -> 1 -> 2 -> 3 -> 다자람)
    - 최소 작물 4개를 연동하십쇼

    # 작물마다 성장 기간을 만들어보세요
    - EX) 하루에 한번씩 성장하는게 아니라 2일 마다 한번씩 성장하는 걸로

    # 화면을 클릭해서 해당 타일에 작물을 배치하는 기능을 만들어 보십쇼
    - 화면 클릭후 작물은 시간 경과에 따라 성장해야합니다.


     *
     *
     *
     * 
     */
    
    public class Crop : MonoBehaviour
    {
        
    }
}